#!/usr/bin/python
# -*- coding: utf-8 -*-

airplane = {
    'title': '飞机',
    'Ename': 'airplane, aeroplane',
    'detail': '飞机是20世纪初最重大的发明之一，公认由美国人莱特兄弟发明。他们在1903年12月17日进行的飞行作为'
              '第一次重于空气的航空器进行的受控的持续动力飞行”被国际航空联合会（FAI）所认可，同年他们创办了“莱特飞机公司”。'
              '自从飞机发明以后，飞机日益成为现代文明不可缺少的工具。它深刻的改变和影响了人们的生活，开启了人们征服蓝天历史',
    'poem': '大鹏一日同风起,扶摇直上九万里.',
    'joker': ' 在一架莫斯科飞往巴库的班机上，一名青年男子突然掏出一把玩具手枪大喊：'
             '“劫机! 我要劫机!我要和机长对话!!” 机长赶紧战战兢兢地过来了，小心冀冀地说道：'
             '“先生，您有什么意见尽管说，您的要求我们都尽量满足，请您先放下枪好吗?这样以免伤及无辜……” '
             '劫匪歇斯底里地吼道：“不!我现在只要求这架飞机立即飞往巴库!!” 机长不禁诧异地问道：“哦，先生，'
             '您听我说，本次航班本来就是飞往巴库的，您可以把枪放下来了。顺便问一句：您的精神没有问题吧?”'
             ' 劫匪勃然大怒道：“你胡说八道什么?!我很好!我已经乘坐你们这个航班三次了，第一次将我劫到了阿富汗!第二次'
             '又将我劫到了伊拉克!”他抑制不住内心的激动说，“这不昨天才将我送回来，这一次无论如何，我都要先劫啦――我要回巴库!”',
}
automobile = {
    'title': '汽车',
    'Ename': 'vehicle',
    'detail': '由动力驱动，具有4个或4个以上车轮的非轨道承载的车辆，主要用于：载运人员和（或）货物；牵引载运人员和（或）货物的车辆',
    'poem': '门有车马宾，金鞍耀朱轮',
    'joker': '交警:先生，您有没有看清楚刚才肇事车辆的牌照？是什么车？\n'
             '路人甲:开的太快了，谁能看清牌照啊，就看到是一大众，白色，好像是捷达。\n'
             '路人乙:你看错了吧，应该是朗逸啊。\n'
             '路人丙:你俩啥眼神啊，分明是速腾！\n'
             '路人丁:速腾你妹，你懂不懂车？那是新宝来好么！\n'
             '路人冇:好了好了，一群车盲都别装X了，警察同志，刚才我看的很清楚，逃逸的车是凌度！\n'
             '警察:……\n'
             '被车撞倒且昏迷在地的路人x此时醒了，轻轻拉住警察叔叔的裤角，微弱颤抖的声音:新……桑……塔……纳……',
}
bird = {
    'title': '鸟',
    'Ename': 'bird',
    'detail': '鸟，又称作鸟儿。定义：体表被覆羽毛的卵生脊椎动物，鸟的主要特征是：身体呈流线型（纺锤型或梭形）'
              '，大多数飞翔生活。体表被覆羽毛，一般前肢变成翼（有的种类翼退化）；胸肌发达；直肠短，食量大消化快，即消'
              '化系统发达，有助于减轻体重，利于飞行；心脏有两心房和两心室，心搏次数快。体温恒定。'
              '呼吸器官除具肺外，还具有多个气囊辅助呼吸，使得鸟类无论在吸气和呼气时，均有氧气通过肺，即双重呼吸。',
    'poem': '五色毛衣比凤雏,深花丛里只如无',
    'joker': '某天考生物，其中有一题是看鸟的腿猜出鸟的名字。某生实在不懂，生气的把卷子一撕准备离开考场。监考老师十分的生气，'
             '于是问他：“你是哪班的，叫什么名字？”某生把裤腿一掀，说：“你猜啊…”',
}
cat = {
    'title': '猫',
    'Ename': 'cat',
    'detail': '猫，属于猫科动物，分家猫、野猫，是全世界家庭中较为广泛的宠物。家猫的祖先据推测是起源于古埃及的沙漠猫，波斯的波斯猫，'
              '已经被人类驯化了3500年（但未像狗一样完全地被驯化）。一般的猫：头圆、颜面部短，前肢五指，后肢四趾，趾端具锐利而弯曲的爪，爪能伸缩。夜行性。'
              '以伏击的方式猎捕其它动物，大多能攀援上树。猫的趾底有脂肪质肉垫，以免在行走时发出声响，捕猎时也不会惊跑鼠。行进时爪子处于收缩状态，防止爪被磨钝，'
              '在捕鼠和攀岩时会伸出来。',
    'poem': '墉集欺猫鼠，林藏逐雀鹯',
    'joker': '动物饲养专业的学生来到了实习现场，却总觉得有些异常。终于，班长壮着胆子向教授提出疑惑：“教授，我们不是实习养猪吗，'
             '可是为什么不见猪的踪影？”教授挥手一指角落中一只只懒洋洋趴着的橘猫，道：“谁说没有猪，猪不就在这儿嘛’'
}
deer = {
    'title': '鹿',
    'Ename': 'deer',
    'detail': '鹿科（Cervidae）是哺乳纲偶蹄目的一科动物。体型大小不等，为有角的反刍类，分布于欧亚大陆、日本、菲律宾、印度尼西亚、北美洲、南美洲'
              '的南纬 40°以北地区及西南非洲，全世界约有34种，共16属约52种。鹿科动物其特征是生有实心的分叉的角，一般仅雄性有1对角，雌性无角，'
              '体长0.75～2.90米，体重9～800千克。',
    'poem': '霜落熊升树，林空鹿饮溪',
    'joker': '老虎抓到一头梅花鹿后要把它吃掉,梅花鹿说:"你不能吃我!"老虎上愣:"为什么?""因为我是国家二级保护.'
             '"老虎笑了:"总不能为了二级保护动物而让一级保护动物饿死吧?',
}
dog = {
    'title': '狗',
    'Ename': 'dog',
    'detail': '狗（拉丁文Canis lupus familiaris）属于脊索动物门、脊椎动物亚门、哺乳纲、真兽亚纲、食肉目、裂脚亚目、犬科动物。中文亦称“犬”，'
              '狗分布于世界各地。狗与马、牛、羊、猪、鸡并称“六畜”。有科学家认为狗是由早期人类从灰狼驯化而来，'
              '驯养时间在4万年前~1.5万年前。被称为“人类最忠实的朋友”，是饲养率最高的宠物，其寿命大约在12~18年 [1]  。'
              '在中国文化中，狗属于十二生肖之一，在十二生肖中的第11位。 [2]',
    'poem': '碧花红尾小仙犬，闲吠五云嗔客来。',
    'joker': '养狗不要帮狗起名“哈哈”，我家邻居有个老奶奶，养了条哈士奇，她以为是哈开头的，就叫哈哈吧。今天她狗走丢了，'
             '老奶奶特着急，在小区四处找，到处喊狗的名字，就哈哈，哈哈，哈哈哈哈哈哈哈哈哈哈……',
}
frog = {
    'title': '青蛙',
    'Ename': 'frog',
    'detail': '青蛙（Frog）属于脊索动物门、两栖纲、无尾目、蛙科的两栖类动物，成体无尾，卵产于水中，体外受精，孵化成蝌蚪，用鳃呼吸，'
              '经过变异，成体主要用肺呼吸，兼用皮肤呼吸。上颌有齿，一般有犁骨齿。肩带固胸型，椎体参差型，'
              '荐椎横突柱状；指趾末端二骨节间没有间介软骨。鼓膜明显隐于皮下，皮肤光滑或有疣粒。舌一般长椭圆形，后端大多具缺刻。',
    'poem': '门前飞杨花,屋后恶水鸣青蛙',
    'joker': '癞蛤蟆总是得不到天鹅心情不悦，青蛙取笑他说：“就你那长相不要太心高了，看我这帅王子的！”于是青蛙轻而易举的就靠近了天鹅，'
             '刚到天鹅身边就被天鹅一口叼住，癞蛤蟆吃惊的瞪大了眼睛，青蛙还在那自信的说：“看到没，天鹅一见到我就主动和我亲嘴呢！'
             '”癞蛤蟆：“可你怎么好像在往天鹅的肚子里钻啊？”青蛙：“我是想进到天鹅的肚子里看看它到底对我是什么心！”',
}
horse = {
    'title': '马',
    'Ename': 'horse',
    'detail': '马在动物分类学中分类为：脊椎动物亚门（Vertebrata）、哺乳纲（Mammalia）、奇蹄目（Perissodactyla）、马科（Equidae）、马属（Equus）、马（Equus caballus） [1]  。是一种草食性动物。现存家马和普氏野马两个亚种 [2]'
              '马被人类驯化以来，在漫长的发展过程中，由于各地区自然环境的影响和不同时期社会经济发展的需要，马的用途经历了肉用、乳用、农业生产、交通运输、军事和运动娱乐等多个阶段交替或互相融合的过程',
    'poem': '马作的卢飞快，弓如霹雳弦惊',
    'joker': '从前,有个猎人骑bai着马,带着猎狗去深山打猎,走了du很久也没打到猎物.天快黑zhi了,人,马和狗都很累,猎人犹豫了一dao下,是否还要继续,'
             ' 最后下定决心,一定要打到猎物再回去.于是一抖缰绳让马继续走,这时,马回头大吼:"你想累死我啊?!"猎人大惊,翻身下马,'
             '拉着猎狗就跑.跑到一棵大树下实在跑不动了,猎狗叹了口气,拍拍胸口说:"靠,吓死我了,马会说话..."',
}
truck = {
    'title': '卡车',
    'Ename': 'truck',
    'detail': '卡车，又称作载货汽车，一般称作货车，指主要用于运送货物的汽车，有时也指可以牵引其他车辆的汽车，属于商用车辆类别。'
              '一般可依照车的重量分为重型和轻型两种。绝大部分货车都以柴油引擎作为动力来源，但有部分轻型货车使用汽油、石油气或者天然气。'
              '1975年7月1日，2.5吨越野车在位于湖北十堰的汽车制造厂正式投产。第二汽车制造厂的建设是中国汽车工业的一个里程碑，'
              '它完全是中国人自己建设完成，在建设过程中没有任何一个外国技术人员参与协助，这标志着中国汽车工业发展已达到了较高的水平。',
    'poem': '车遥遥兮马洋洋，追思君兮不可忘。',
    'joker': '擎天柱又一次在保卫地球和人类的战役中被炸成了一堆碎片，大黄蜂很伤心，到处找能修好的地方，问了先知，'
             '先知说：要修它，只能去中国山东，找蓝翔汽修!于是大黄蜂带着碎片去了蓝翔，师傅打开一看，皱着眉头说：这玩意儿安好是个啥?'
             '大黄蜂哽咽地说：你若安好，便是擎天!',
}
ship = {
    'title': '船',
    'Ename': 'ship',
    'detail': '船或船舶，指的是：举凡利用水的浮力，依靠人力、风帆、发动机（如蒸汽机、燃气涡轮、柴油引擎、核动力机组）等动力，'
              '牵、拉、推、划、或推动螺旋桨、高压喷嘴，使能在水上移动的交通运输手段。另外，民用船通常称为船（古称舳舻）、船舶、轮机、舫，'
              '军用船称为舰（古称艨艟）、舰艇，小型船称为艇、 舢舨、筏或舟，其总称为舰艇或船舶。',
    'poem': '沉舟侧畔千帆过，病树前头万木春',
    'joker': '在艘要沉的bai船上，坐着动物。这时候大象说我们来讲笑话谁的笑话只把我们全都逗笑了，到谁就不用跳下去，反之，有一个人不笑'
             ' 要跳下去。这时牛讲了一个爆笑的笑话，动物都笑了，只有猪没笑。牛只好跳了下去，然后猴子又讲了一个，这回都没笑'
             ' 只有猪在那里大笑，还不停地说：哈哈！刚才牛讲的笑话太好笑了！',
}
details = {
    'airplane': airplane,
    'automobile': automobile,
    'bird': bird,
    'cat': cat,
    'deer': deer,
    'dog': dog,
    'frog': frog,
    'horse': horse,
    'truck': truck,
    'ship': ship,
}

# "airplane", 'automobile', 'bird', 'cat', 'deer', 'dog', 'frog', 'horse', 'ship', 'truck'
